Tests/StressTest/600VU_per_S/UseCaseB.yml
config:
  plugins:
  target: "https://kwqnze338k.us-east-1.awsapprunner.com"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: 1. Ramp Up
    - duration: 240
      arrivalRate: 50
      rampTo: 200
      name: 2. Ramp Up
    - duration: 240
      arrivalRate: 200
      rampTo: 600
      name: 3. Ramp Up

scenarios:
  - name: "Choose one recipe"
    flow:
      - get:
          url: "/recipes"
      - think: 2
      - get:
          url: "/recipes/2"
      - think: 1